# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
cask_args appdir: '/Applications'

# core (out of alpabetical order because of dependencies)
brew 'coreutils'
brew 'gpg'
brew 'asdf'

# shells
brew 'bash'
brew 'fish'
brew 'xonsh'
brew 'zsh'

# cli
brew 'fd'
brew 'fzf'
brew 'mosh', args: ['head'] # need head to work with blink on iPad
brew 'ripgrep'
brew 'tmux'

# dev
brew 'lazygit'
brew 'neovim'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['head'] # doesn't exist in brew core yet
cask 'anaconda' # this will only get installed on macos because it's a cask

# libraries
brew 'luarocks'

# fonts
cask 'font-jetbrains-mono'
cask 'font-jetbrainsmono-nerd-font'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# macOS Applications

cask 'alfred'
cask 'bartender'
cask 'bettertouchtool'
cask 'brave-browser'
cask 'contexts'
cask 'dash'
cask 'discord'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'flux'
cask 'github'
cask 'iterm2'
cask 'karabiner-elements'
cask 'krisp'
cask 'rectangle'
cask 'setapp'
cask 'sidequest'
cask 'slack'
cask 'spotify'
cask 'transmission'
cask 'visual-studio-code'
cask 'vivaldi'
cask 'vlc'
