# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tab 'homebrew/cask-drivers'
cask_args appdir: '/Applications'

# core (out of alpabetical order because of dependencies)
brew 'coreutils'
brew 'gpg'
brew 'asdf'

# shells
brew 'bash'
brew 'fish'
brew 'xonsh'
brew 'zsh'

# cli
brew 'bat'
brew 'exa'
brew 'fd'
brew 'fzf'
brew 'global'
brew 'mosh', args: ['head'] # need head to work with blink on iPad
brew 'ripgrep'
brew 'tmux'

# dev
brew 'diff-so-fancy'
brew 'git'
brew 'git-delta' # slightly better (imo) git-diff tool
brew 'lazygit'
brew 'neovim'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['head'] # doesn't exist in brew core yet
# cask 'anaconda' # this will only get installed on macos because it's a cask

# libraries
brew 'luarocks'

# fonts
# cask 'font-jetbrains-mono' # can't install these until they're signed
# cask 'font-jetbrainsmono-nerd-font'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# macOS Applications
cask 'alfred'
cask 'bartender'
cask 'bettertouchtool'
# cask 'brave-browser'
# cask 'contexts'
cask 'dash'
cask 'discord'
# cask 'dropbox'
cask 'fantastical'
cask 'firefox'
# cask 'flux'
# cask 'github'
cask 'iterm2'
cask 'karabiner-elements'
cask 'krisp'
cask 'obsidian'
cask 'pandora'
# cask 'popclip'
# cask 'rectangle'
# cask 'riot'
cask 'sidequest'
cask 'slack'
cask 'sonos'
cask 'spotify' # won't currently install because it doesn't have a hash - June 3, 2020
cask 'transmission'
cask 'visual-studio-code'
cask 'vivaldi'
cask 'vlc'

# Oculus Quest Specific
cask 'android-platform-tools'
brew 'scrcpy'
